<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <meta http&#45;equiv="Content&#45;Type" content="text/html; charset=iso&#45;8859&#45;1">
    <link rel="sortcut icon" href="logo.png" type="image/x&#45;icon" />
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/animate.css/4.1.1/animate.min.css" />
    <title>Flowchart | Reconhecimento de Fluxogramas</title>
    <link href="https://fonts.googleapis.com/css2?family=Poppins:wght@300;500;700&display=swap" rel="stylesheet">
    <link href="default.css" rel="stylesheet" type="text/css" media="all" />
    <link rel="stylesheet" href="css/libs/animate.css">
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.10.1/jquery.min.js"></script>
    <script src="dist/wow.js"></script>
    <script type="text/javascript">
        jQuery(document).ready(function() {

            jQuery("#subirTopo").hide();

            jQuery('a#subirTopo').click(function() {
                jQuery('body,html').animate({
                    scrollTop: 0
                }, 800);
                return false;
            });

            jQuery(window).scroll(function() {
                if (jQuery(this).scrollTop() > 1000) {
                    jQuery('#subirTopo').fadeIn();
                } else {
                    jQuery('#subirTopo').fadeOut();
                }
            });

            jQuery('.image&#45;link').magnificPopup({
                type: 'image'
            });
        });

        wow = new WOW({
            animateClass: 'animated',
            offset: 100,
            callback: function(box) {
                console.log("WOW: animating <" + box.tagName.toLowerCase() + ">")
            }
        });
        wow.init();
    </script>
</head>

<body>
    <section class="wow fadeInDown">
        <div id="wrapper1">
            <div id="header&#45;wrapper">
                <div id="header">
                    <nav class="mynav">
                        <div id="logo"><img src="images/logo.png"></div>
                        <div></div>
                        <ul>
                            
                            <li><a href="#wrapper2" class="one">Empresa</a></li>
                            <li><a href="#wrapper3" class="two">Parceiros</a></li>
                            <li><a href="#wrapper4" class="three">Contatos</a></li>
                        </ul>
                    </nav>
                    <span class="target"></span>
                </div>
            </div>
        </div>
    </section>
    <section class="wow fadeInDown">
        <div id="wrapper2">
            <div id="welcome" class="container">
                <div class="title">
                    <h2>Empresa</h2>
                </div>
                <p>Desenvolvemos projetos e soluções customizadas na área de tecnologia para gerar benefícios e resultados satisfatórios para nossos clientes.

Possuímos profissionais altamente qualificados, todos com mais de 15 anos de experiência nos mais diversos segmentos.

                </p>
                <div class="title"><h3>Áreas de atuação</h3></div>
                <ul>      
                    <li>Inteligência Predial</a></li>
                    <li>OCR | Reconhecimento de Caracteres</a></li>
                    <li>CFTV Digital</a></li>
                    <li>Controle de Acesso</a></li>
                    <li>Leitor Facial</a></li>
                    <li>Projeto e Execução</a></li>
                    <li>Infraestrutura de dados e tecnologia</a></li>
                    <li>Automação Industrial</a></li>
                    <li>Lacres Eletrônicos</a></li>
                    <li>Software de agendamento e operação logística</a></li>
                    <li>FFT – Segurança e proteção perimetral</a></li>
                    <li>Implementação de RFID - Portolog</a></li>
                    <li>Desenvolvimento de Patentes e Soluções Inovadoras</a></li>
                    <li>Integração de Sistema</a></li>
                </ul>
            </div>
        </div>
    </section>
    <section class="wow fadeInDown">
        <div id="wrapper3">
            <div id="portfolio" class="container">
                <div class="title">
                    <h2>Parceiros</h2>
                    <p>A presente proposta pretende propiciar o incremento a metodologias did&aacute;ticas de ensino b&aacute;sico de l&oacute;gica de programa&ccedil;&atilde;o de computadores, permitindo a inclus&atilde;o de alunos com a aus&ecirc;ncia
                        total ou parcial da vis&atilde;o, garantindo&#45;lhes maior grau de independ&ecirc;ncia:</p>
                </div>
            </div>
            <section class="wow slideInRight">
                <div class="columns">
                    <div class="column1">
                        <div class="box">
                            <img src="images/3.png">
                            <p>O aluno cego, com o aux&iacute;lio de pe&ccedil;as tridimensionais e cart&otilde;es impressos em Braille, monta um fluxograma de algum algor&iacute;tmo;</p>
                        </div>
                    </div>
                    <div class="column2">
                        <div class="box">
                            <img src="images/5.png">
                            <p>Com um aparelho fotogr&aacute;fico, imagens retiradas do fluxograma s&atilde;o enviadas para a aplica&ccedil;&atilde;o que far&aacute; a interpreta&ccedil;&atilde;o do algor&iacute;tmo;</p>
                        </div>
                    </div>
                    <div class="column3">
                        <div class="box">
                            <img src="images/7.png">
                            <p>Ap&oacute;s a foto ser enviada para a aplica&ccedil;&atilde;o, a mesma inicia o processo de reconhecimento do texto e dos formatos;</p>
                        </div>
                    </div>
                    <div class="column4">
                        <div class="box">
                            <img src="images/9.png">
                            <p>O programa gera um arquivo de texto contendo o c&oacute;digo fonte do algoritmo arquitetado pelo aluno, seguindo a sintaxe da linguagem de programa&ccedil;&atilde;o Portugol;</p>
                        </div>
                    </div>
                    <div class="column5">
                        <div class="box">
                            <img src="images/11.png">
                            <p>O arquivo poder&aacute; ser usado para fins did&aacute;ticos, servindo como uma ferramenta avaliadora para o professor, ou como um material de estudo para o aluno.</p>
                        </div>
                    </div>

                </div>

            </section>
        </div>
    </section>
    <section class="wow fadeInDown">
        <div id="wrapper4">
            <div id="explain" class="container">
                <div class="title">
                    <h2>Contatos</h2>
                    <p>Considerando&#45;se que o avan&ccedil;o tecnol&oacute;gico proporcionada pela constante globaliza&ccedil;&atilde;o e a &ecirc;nfase no uso de redes de computadores tornam o acesso &agrave;s informa&ccedil;&otilde;es algo cada vez mais
                        primordial, &eacute; fundamental incitar a busca por estrat&eacute;gias pedag&oacute;gicas que contribuam para a aquisi&ccedil;&atilde;o de conhecimento a todos os alunos, especialmente a aqueles com defici&ecirc;ncia visual. As
                        caracter&iacute;sticas sensoriais que alunos cegos ou com baixa vis&atilde;o apresentam acentuam, sobretudo, as barreiras e dificuldades que o ensino tradicional brasileiro demonstra atualmente em sua constitui&ccedil;&atilde;o.
                        Isso pode ser evidenciado como uma consequ&ecirc;ncia da existente metodologia de prepara&ccedil;&atilde;o tendencialmente visual a que os alunos se encontram a merc&ecirc; nas institui&ccedil;&otilde;es de ensino. Al&eacute;m
                        da assimila&ccedil;&atilde;o de conceitos te&oacute;ricos, o interesse por assuntos pr&aacute;ticos, como a programa&ccedil;&atilde;o de computadores, sempre foi um desafio a ser enfrentado e, por mais que existam institui&ccedil;&otilde;es
                        que adotem esse conte&uacute;do como uma disciplina escolar, o aprendizado tende a ser pouco efetivo para o aluno com defici&ecirc;ncia visual. <br> <br> Em vista disso, &eacute; mister proporcionar ferramentas e t&eacute;cnicas
                        que permitam &agrave;s pessoas com defici&ecirc;ncia visual inserirem&#45;se no mundo da programa&ccedil;&atilde;o de computadores e oferecer sua perspectiva de mundo. Sendo assim, o presente trabalho prop&otilde;e&#45;se a oferecer
                        um prot&oacute;tipo de uma ferramenta t&aacute;til de programa&ccedil;&atilde;o juntamente com recursos de reconhecimento de imagens e caracteres utilizando deep learning, que executa a convers&atilde;o das imagens e caracteres
                        reconhecidos para c&oacute;digo fonte em uma linguagem de programa&ccedil;&atilde;o, que poder&aacute; ser compilado em alguma IDE, gerando&#45;se o respectivo c&oacute;digo execut&aacute;vel. Concomitantemente, a cria&ccedil;&atilde;o
                        dessas ferramentas municiar&aacute; educadores da &aacute;rea da Inform&aacute;tica com recursos did&aacute;ticos espec&iacute;ficos ao ensino tecnol&oacute;gico de alunos com defici&ecirc;ncia visual
                    </p>
                </div>
            </div>
        </div>
    </section>
    <section class="wow fadeInDown">
        <div id="wrapper5">
            <div id="results" class="container">
                <div class="title">
                    <h2>resultados</h2>
                    <p>Nessa se&ccedil;&atilde;o mostraremos as metodologias utilizadas para tornar a proposta vi&aacute;vel. Exemplos dos resultados da aplica&ccedil;&atilde;o estar&atilde;o dispostos ao decorrer. <br><br>Para elaborar a ferramenta que
                        permita a deficientes visuais entender e elaborar programas de computador, diversas frentes est&atilde;o sendo abordadas e integradas neste trabalho, quais sejam: a) a elabora&ccedil;&atilde;o das pe&ccedil;as f&iacute;sicas de
                        fluxograma, almejando que sua estrutura seja apta a pessoas cegas, compreendendo o uso de materiais facilmente encontrados em papelarias, o que reafirma a proposta de ser uma ferramenta de produ&ccedil;&atilde;o acess&iacute;vel;
                        b) o registro da imagem do fluxograma para ser utilizada na etapa de seu reconhecimento; c) a utiliza&ccedil;&atilde;o de um software de reconhecimento de imagens, que se utiliza de CNNs, e que gera um arquivo contendo as identifica&ccedil;&otilde;es
                        e descri&ccedil;&otilde;es das imagens e textos reconhecidos; d) a utiliza&ccedil;&atilde;o de um software de convers&atilde;o das identifica&ccedil;&otilde;es e textos, obtidos na etapa anterior, em c&oacute;digo fonte em uma
                        linguagem de programa&ccedil;&atilde;o pr&eacute;&#45;determinada (Python e/ou Portugol); e) o uso de uma IDE para importar, compilar e executar o c&oacute;digo fonte gerado na etapa anterior.<br><br> Para a confec&ccedil;&atilde;o
                        das pe&ccedil;as que teriam contato direto com o aluno, foram usados materiais como isopor, papel EVA, papel contact e im&atilde;s. Na superf&iacute;cie de cada pe&ccedil;a &eacute; inserido um cart&atilde;o impresso em Braille
                        que cont&eacute;m seus caracteres em relevo, necess&aacute;rio para a leitura e compreens&atilde;o pelo aluno cego. O suporte de cada cart&atilde;o foi feito de peda&ccedil;os pequenos de cartolina enrolados e fixados com cola
                        espec&iacute;fica para este material. As pe&ccedil;as foram produzidas de acordo com a necessidade dos algoritmos que seriam ministrados na experimenta&ccedil;&atilde;o com o p&uacute;blico alvo da ferramenta. <br><br>Sendo assim,
                        as pe&ccedil;as seguem os formatos de terminal, decis&atilde;o l&oacute;gica, processamento, entrada e sa&iacute;da de dados. Para o formato de decis&atilde;o l&oacute;gica foram atribu&iacute;dos dois modelos, que se diferem para
                        consagrar suas duas possibilidades de uso. Veja na imagem a seguir um exemplo de algoritmo presente no fluxograma.
                    </p>
                    <section class="wow slideInRight">
                        <div class="example">
                            <img src="images/ex1.png">
                            <div class="zoom">
                                <a class="test&#45;popup&#45;link" href="images/ex1.png">Ampliar</a>
                            </div>
                            <p>Os fluxos s&atilde;o indicados com setas feitas do material emborrachado EVA. Cada componente possui im&atilde; em sua traseira, para que assim o aluno possa arquitetar o algoritmo posicionando facilmente as pe&ccedil;as em
                                uma superf&iacute;cie met&aacute;lica, a qual consistiu, na experimenta&ccedil;&atilde;o, de um painel met&aacute;lico tatilmente seccionado e forrado com um fundo preto. Veja o c&oacute;digo gerado do exemplo acima:
                            </p>
                            <div class="columns">
                                <div class="column1">
                                    <div class="box">
                                        <h3>Portugol</h3>
                                        <p>inicio<br>VALOR: inteiro <br>leia(VALOR) <br>VALOR
                                            <&#45; VALOR * 5 <br>escreva(VALOR) <br>fim </p>
                                    </div>
                                </div>

                                <div class="column2">
                                    <div class="box">
                                        <h3>Python</h3>
                                        <p>#Vari&aacute;vel do tipo inteiro <br>VALOR = int(input())<br> VALOR = VALOR * 5 <br>print(VALOR)
                                        </p>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <p>Visando consagrar o reconhecimento das imagens obtidas, assim como a classifica&ccedil;&atilde;o dos seus componentes, houve a necessidade da cria&ccedil;&atilde;o de uma Rede Neural Convolucional. Consequentemente, houve a necessidade
                            tamb&eacute;m do encontro de um dataset adequado – um conjunto que compreendesse diversas imagens dos formatos do fluxograma e das setas para que o uso dessa ferramenta realizasse o esperado. Quanto ao desenvolvimento da rotina
                            de treinamento, usou&#45;se uma arquitetura menos complexa, inspirada no modelo da Visual Geometric Group, o VGGNet. A ferramenta que possibilitou o treinamento da CNN foi o Tensorflow que, criado pela Google, consiste em uma
                            biblioteca opensource usada para a gera&ccedil;&atilde;o de modelos de machine learning, tornando sua aplicabilidade mais f&aacute;cil gra&ccedil;as a sua interface escrita em Python: o Keras, uma API front&#45;end. Veja na
                            imagem a seguir mais um exemplo de arquitetura de um algoritmo usando essas pe&ccedil;as citadas:
                        </p>
                    </section>

                    <section class="wow slideInRight">
                        <div class="example">
                            <img src="images/ex2.png">
                            <div class="zoom">
                                <a class="test&#45;popup&#45;link" href="images/ex2.png">Ampliar</a>
                            </div>
                            <p>Para que pudesse ser feita a leitura dos fluxogramas arquitetados e consequentemente a gera&ccedil;&atilde;o dos c&oacute;digos, programou&#45;se um script que possui m&eacute;todos que atuam na seguinte ordem de execu&ccedil;&atilde;o:
                                a) leitura da imagem enviada seguindo a dimens&atilde;o de tr&ecirc;s colunas por oito linhas, como mostra a FIGURA 2; b) o recorte individual de seus quadrantes; c) a classifica&ccedil;&atilde;o dos componentes de cada
                                quadrante a partir das redes neurais treinadas; d) a extra&ccedil;&atilde;o do texto escrito em cada estrutura l&oacute;gica; e) o mapeamento do fluxo do fluxograma; f) a gera&ccedil;&atilde;o do c&oacute;digo fonte em
                                um arquivo de texto, como mostra o outro exemplo abaixo:
                            </p>
                            <div class="columns">
                                <div class="column1">
                                    <div class="box">
                                        <h3>Portugol</h3>
                                        <p>inicio <br>NUMERO: inteiro <br> leia(NUMERO) <br>se (NUMERO % 2 = 0) entao <br>escreva("N&Uacute;MERO &Eacute; PAR") <br>senao <br>escreva("N&Uacute;MERO &Eacute; &Iacute;MPAR") <br>fimse <br>fim
                                        </p>
                                    </div>
                                </div>

                                <div class="column2">
                                    <div class="box">
                                        <h3>Python</h3>
                                        <p>#Vari&aacute;vel do tipo inteiro <br>NUMERO = int(input()) <br>if NUMERO % 2 == 0: <br>print("N&uacute;MERO &eacute; PAR") <br>else: <br>print("N&uacute;MERO &eacute; &iacute;MPAR")
                                        </p>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <p>Optou&#45;se por trabalhar, inicialmente, com a sintaxe da linguagem de programa&ccedil;&atilde;o Portugol, para a realiza&ccedil;&atilde;o das gera&ccedil;&otilde;es dos c&oacute;digos, devido a essa linguagem j&aacute; ser trabalhada
                            em uma das disciplinas do ensino de programa&ccedil;&atilde;o computacional no campus em que esse projeto foi desenvolvido. Idealmente, o aluno cego arquitetaria o fluxograma com o aux&iacute;lio de cart&otilde;es impressos
                            em Braille, onde nestes conteriam os direcionamentos do algoritmo a ser trabalhado. No entanto, fez&#45;se necess&aacute;rio deixar o reconhecimento dos caracteres em Braille para uma pr&oacute;xima oportunidade, visto que
                            o tempo de vig&ecirc;ncia n&atilde;o foi o bastante para englobar a dificuldade e complexidade de construir uma ferramenta assim. Dessa maneira, para conseguir efetivar a ideia da proposta desse projeto, utilizaram&#45;se cart&otilde;es
                            com caracteres latinos para serem analisados pela tecnologia OCR. Veja a seguir mais um exemplo e, assim como nos demais, perceba como cada texto dentro das pe&ccedil;as &eacute; escrito:
                        </p>
                    </section>
                    <section class="wow slideInRight">
                        <div class="example">
                            <img src="images/ex3.png">
                            <div class="zoom">
                                <a class="test&#45;popup&#45;link" href="images/ex3.png">Ampliar</a>
                            </div>
                            <p>Para a extra&ccedil;&atilde;o desses textos, foram testadas duas op&ccedil;&otilde;es de API de reconhecimento OCR: o Tesseract e o OCR Space. Inicializando os testes, a principal limita&ccedil;&atilde;o que o Tesseract apresentou
                                foi a confus&atilde;o entre o que deveria ou n&atilde;o ser lido como um caractere. Sendo assim, mesmo com as etapas de pr&eacute;&#45;processamento de imagem, n&atilde;o se obteve &ecirc;xito em eliminar totalmente os
                                demais elementos que n&atilde;o fossem texto em todos os testes, comprometendo o resultado final das linhas de c&oacute;digo geradas. Ao observar os empecilhos demonstrados, a API OCR Space conseguiu alcan&ccedil;ar melhor
                                desempenho. A principal diferen&ccedil;a &eacute; a facilidade que o OCR Space disponibiliza ao usu&aacute;rio ao n&atilde;o demandar etapas de pr&eacute;&#45;processamento antes do texto ser enviado para an&aacute;lise.
                                Os principais problemas que essa API apresentou foi no reconhecimento de alguns caracteres espec&iacute;ficos, principalmente aos que correspondem a s&iacute;mbolos matem&aacute;ticos.
                            </p>
                            <div class="columns">
                                <div class="column1">
                                    <div class="box">
                                        <h3>Portugol</h3>
                                        <p>inicio <br>IDADE: inteiro <br>IDADE
                                            <&#45; 18 <br>se (IDADE >= 18) entao <br>escreva("VOC&Ecirc; &Eacute; ADULTO") <br>senao <br>escreva("VOC&Ecirc; N&Atilde;O &Eacute; ADULTO") <br>fimse <br>fim
                                        </p>
                                    </div>
                                </div>
                                <div class="column2">
                                    <div class="box">
                                        <h3>Python</h3>
                                        <p>#Vari&aacute;vel do tipo inteiro <br>IDADE = 18 <br>if IDADE >= 18: <br>print("VOC&Ecirc; &Eacute; ADULTO") <br>else: <br>print("VOC&Ecirc; N&Atilde;O &Eacute; ADULTO")</p>
                                    </div>
                                </div>
                            </div>
                            <p>Para contornar o problema anteriormente citado, fora implementado uma fun&ccedil;&atilde;o que realiza o tratamento dos textos extra&iacute;dos, sendo assim, a partir de palavras chaves, a pr&oacute;pria aplica&ccedil;&atilde;o
                                realiza a substitui&ccedil;&atilde;o dos caracteres, seguindo a sintaxe da linguagem escolhida. <br><br>Infelizmente, devido &agrave; pandemia do Novo Coronav&iacute;rus, a valida&ccedil;&atilde;o desse projeto com o p&uacute;blico
                                alvo – alunos cegos do pr&oacute;prio campus &#45; n&atilde;o conseguiu ser atingida. Essa etapa se faz importante, pois, embora j&aacute; se tenha efetuado uma valida&ccedil;&atilde;o dos objetos anteriormente com um aluno
                                deficiente visual, toda altera&ccedil;&atilde;o feita no material t&aacute;til para conseguir melhorar o reconhecimento das imagens deveria ter sua efetividade avaliada por esse p&uacute;blico. Cabe observar aqui que, visando
                                agilizar os trabalhos, e considerando a impossibilidade moment&acirc;nea de realizar os testes com deficientes visuais, a partir de um certo ponto, as imagens de testes &#45; os fluxogramas arquitetados &#45; foram confeccionadas
                                em editores de imagem, tendo como base as imagens inicialmente obtidas dos objetos f&iacute;sicos sobrepostos ao painel, o que n&atilde;o invalidou a ess&ecirc;ncia do projeto. Dessa forma, atingiram&#45;se os resultados
                                esperados, dado o est&aacute;gio de prototipagem da aplica&ccedil;&atilde;o. <br><br> Em vista do obtido nos resultados, conseguiu&#45;se atingir a ess&ecirc;ncia da proposta do projeto, ficando pendentes algumas quest&otilde;es
                                que se configuram como melhorias a serem implementadas em trabalhos futuros. Entre estas melhorias, destacam&#45;se: a) incremento de um tradutor de caracteres em Braille, a fim de que n&atilde;o seja mais necess&aacute;rio
                                usar caracteres latinos; b) incremento do reconhecimento de mais estruturas l&oacute;gicas, como as de la&ccedil;os de repeti&ccedil;&atilde;o; c) adicionar a op&ccedil;&atilde;o de gerar o c&oacute;digo em mais de uma
                                sintaxe de linguagem de programa&ccedil;&atilde;o, podendo atender mais de uma disciplina do curso do aluno; d) aumentar o espa&ccedil;o e a quantidade de quadrantes, permitindo que o aluno possa desenvolver algoritmos
                                mais complexos; e) incrementos em IDEs a serem utilizadas pelos deficientes visuais de forma a proporcionar&#45;lhes maior autonomia. <br><br> Veja abaixo um v&iacute;deo explicativo em que o projeto foi apresentado na
                                Semana Nacional de Ci&ecirc;ncia e Tecnologia:
                            </p>
                            <div style="text-align: center;">
                                <iframe width="560" height="315" src="https://www.youtube.com/embed/1qiyk5wlrng" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                            </div>

                        </div>
                    </section>
                </div>
            </div>
        </div>
    </section>

    <section class="wow fadeInDown">
        <div id="wrapper6">
            <div id="about" class="container">
                <div class="title">
                    <h2>sobre</h2>
                    <p>Meu nome &eacute; Jo&atilde;o Pedro Civita e sou estudante do Instituto Federal de S&atilde;o Paulo (IFSP). Essa proposta foi desenvolvida como um projeto de inicia&ccedil;&atilde;o cient&iacute;fica, realizado por meio do Programa
                        Institucional de Bolsas de Inicia&ccedil;&atilde;o Cient&iacute;fica e Tecnol&oacute;gica do Instituto Federal de Educa&ccedil;&atilde;o Ci&ecirc;ncia e Tecnologia de S&atilde;o Paulo (PIBIFSP). Todo o seu desenvolvimento foi realizado
                        nas abrang&ecirc;ncias do campus do instituto. <br><br>Para mais informa&ccedil;&otilde;es, entre em contato pelo e&#45;mail
                        <strong>jpcivita2011@hotmail.com</strong>. </p>
                </div>
            </div>
        </div>
    </section>

    <div id="copyright" class="container">
        <p>&copy; Flowchart. Todos os direitos reservados.</a>.</p>
    </div>

    <a id="subirTopo">
        ^ <br> subir
      </a>
</body>

</html>
